Trancemania/proj_xtr_keil/More_STM32F4xx_Ethernet_Example/Project/FreeRTOS/httpserver_netconn/src/main.c
  /*Initialize LCD and Leds */ 
  LCD_LED_Init();
	CUSTOM_GPIO_Init();
	CUSTOM_PWM_Init();
	
	//test code
//	TIM_SetAutoreload(TIM3, 1333);
//	TIM_SetCompare1(TIM3, 100);

  /*Initialize Serial COM */ 
  STM_CUSTOM_COMInit(CUSTOM_NO_COM1, &USART_InitStructure);
	STM_CUSTOM_COMInit(CUSTOM_NO_COM2, &USART_InitStructure);
	STM_CUSTOM_COMInit(CUSTOM_NO_COM3, &USART_InitStructure);
//	STM_CUSTOM_COMInit(CUSTOM_NO_COM4, &USART_InitStructure);
	TM_USART_DMA_Init(USART1);
	TM_USART_DMA_Init(USART2);
	TM_USART_DMA_Init(USART3);
//	TM_USART_DMA_Init(UART4);
//  DMA_printf(USART1, "\n\rSerial communication complete!\n\r");
	
  /* configure Ethernet (GPIOs, clocks, MAC, DMA) */ 
  ETH_BSP_Config();
    
  /* Initilaize the LwIP stack */
  LwIP_Init();
  
  /* Initialize webserver demo */
  http_server_netconn_init();
	
	//create semaphore
	 vSemaphoreCreateBinary(exti_xSemaphore);
	 vSemaphoreCreateBinary(pwm_xSemaphore);
	 vSemaphoreCreateBinary(uart_A1_xSemaphore);
	 vSemaphoreCreateBinary(uart_A2_xSemaphore);
	 vSemaphoreCreateBinary(uart_A3_xSemaphore);


#ifdef USE_DHCP
  /* Start DHCPClient */
  xTaskCreate(LwIP_DHCP_task, "DHCPClient", configMINIMAL_STACK_SIZE * 4, NULL,DHCP_TASK_PRIO, NULL);
#endif

  /* Start UDP task */
//  xTaskCreate(LwIP_UDP_task, "UDP", configMINIMAL_STACK_SIZE * 4, NULL, UDP_TASK_PRIO, NULL);
	

  /* Start toogleLed4 task : Toggle LED4  every 250ms */
  xTaskCreate(ToggleLed4, "LED4", configMINIMAL_STACK_SIZE, NULL, LED_TASK_PRIO, NULL);
	
  /* Start custom task : printf */
  xTaskCreate(uart_task, "UART", configMINIMAL_STACK_SIZE * 4, NULL, UART_TASK_PRIO, NULL);

  /* Start custom task : ETH_printf */
//  xTaskCreate(ETH_Printf_task, "ETH_Printf", configMINIMAL_STACK_SIZE * 4, NULL, ETH_PRINTF_TASK_PRIO, NULL);

//ETH send ready
	
  /* Start scheduler */
  vTaskStartScheduler();

  /* We should never get here as control is now taken by the scheduler */
  for( ;; );

}

/**
  * @brief  custom uart task
  * @param  pvParameters not used
  * @retval None
  */
void uart_task(void * pvParameters)
{
  int ch;
	int cnt = 0;
	uint8_t buffer[128];
	portBASE_TYPE xHigherPriorityTaskWoken;
  for ( ;; ) {
    
    while (USART_GetFlagStatus(CUSTOM_COM1, USART_FLAG_RXNE) == RESET);
  	
    ch = USART_ReceiveData(CUSTOM_COM1);
		
		//flag for frame, data and misbehave
		
		if (ch == 0xA6) {
				cnt = 0;
				UART_recv_buffer[cnt] = ch;
				cnt++;
				while (cnt <= 12) {
					while (USART_GetFlagStatus(CUSTOM_COM1, USART_FLAG_RXNE) == RESET);
					UART_recv_buffer[cnt] = USART_ReceiveData(CUSTOM_COM1);
//					switch (ch){
//						case 0x0D:   //0A send 
//							buffer[cnt] = ch;
//							ETH_length = cnt + 1;
//							p = pbuf_alloc(PBUF_TRANSPORT, ETH_length, PBUF_RAM);
//							memcpy(p->payload, &buffer, ETH_length);
//							p->len = ETH_length;
//							udp_sendto_if(pcb, p, &dst_addr, dst_port, &xnetif);
//							pbuf_free(p);
//							cnt++;
//							break;
//						default:
//							//if cnt>=127
//							buffer[cnt] = ch;
//							cnt++;
//							break;
//					}
				}
				if ( UART_recv_buffer[12] == 0x86) {
					switch ( UART_recv_buffer[2]) {
						case 0x55:
							xSemaphoreGiveFromISR( uart_A1_xSemaphore, &xHigherPriorityTaskWoken );
							break;
						case 0x71:
							switch ( UART_recv_buffer[7]) {
								case 1:
//									xSemaphoreGiveFromISR( uart_A2_xSemaphore, &xHigherPriorityTaskWoken );
									break;
								case 2:
//									xSemaphoreGiveFromISR( uart_A3_xSemaphore, &xHigherPriorityTaskWoken );
									break;
								default:
									break;
							}
							break;
						default:
							break;
					}
				}
				//else err fun
		}
	  
//    switch (ch){
//			case 0x0A:   //0A send 
//				buffer[cnt] = ch;
//				ETH_length = cnt + 1;
//				p = pbuf_alloc(PBUF_TRANSPORT, ETH_length, PBUF_RAM);
//				memcpy(p->payload, &buffer, ETH_length);
//				p->len = ETH_length;
//				udp_sendto_if(pcb, p, &dst_addr, dst_port, &xnetif);
//				pbuf_free(p);
//				cnt = 0;
//				break;
//			default:
//				//if cnt>=127
//				buffer[cnt] = ch;
//				cnt++;
//				break;
//		}
//		if( xSemaphore_UDP != NULL )    {
			
//				ETH_printf("%c", ch&0xff);    
//    DMA_printf(USART1, "%c", ch&0xff);
//		}
  }
}


void udp_recv_fn(void *arg, struct udp_pcb *pcb, struct pbuf *p, struct ip_addr *addr, u16_t port){
	if (p != NULL) {   //&& p->len == 2?
		//check addr port
		
		// copy command to buffer
		memcpy(ETH_recv_buffer, &p->payload, p->len);
		
		// for command + last time mode
//		command_H = ETH_recv_buffer[1];
//		command_L = ETH_recv_buffer[0];
		
		// state machine mode
		command = ETH_recv_buffer[0];
		
		//check if command available
		if (command == 0x00	||	\
			  command == 0xFF ||  \
		    command == 0x01 ||  \
			  command == 0x02 ||  \
				command == 0x03 ||  \
				command == 0x04 ||  \
				command == 0x05 ||  \
				command == 0x06 ||  \
				command == 0x07 ||  \
				command == 0x08 ||  \
				command == 0x09 ||  \
				command == 0x0A ||  \
				command == 0x0B ||  \
				command == 0x0C ||  \
				command == 0x0D ||  \
				command == 0x0E ||  \
				command == 0x0F ||  \
				command == 0x10 ||  \
				command == 0x11 ||  \
				command == 0x12 ||  \
				command == 0x13 ||  \
				command == 0x14 ||  \
				command == 0x15 ||  \
				command == 0x16 ||  \
				command == 0x17 ||  \
				command == 0x18 ||  \
				command == 0x19 ||  \
				command == 0x1A ||  \
				command == 0x1B ||  \
				command == 0x1D ||  \
				command == 0x1F ||  \
				command == 0x20 ||  \
				command == 0x21 ||  \
				command == 0x22 ||  \
				command == 0x23 ||  \
				command == 0x24 ||  \
				command == 0xF0 ) {
			//delete filed task
			if( field_xHandle != NULL ) {
				vTaskDelete( field_xHandle );
			}
			//delete command process task
			if( process_command_xHandle != NULL ) {
				vTaskDelete( process_command_xHandle );
			}
			//delete large/small field task
			
			//create command process task
			xTaskCreate(process_command_task, "PROCESS COMMAND", configMINIMAL_STACK_SIZE * 4, NULL, PROCESS_COM_TASK_PRIO, &process_command_xHandle);
			
