Trancemania/proj_xtr_keil/More_STM32F4xx_Ethernet_Example/Project/FreeRTOS/httpserver_netconn/src/main.c
						// seems no use
						if (xSemaphoreTake( pwm_xSemaphore, portMAX_DELAY) == pdTRUE) {
						}
						
						if( process_command_xHandle != NULL ) {
							vTaskDelete( process_command_xHandle );
						}
						
					}
					
				}
				break;		
      case 0x23:		//regulate 4k

				//config DO6/7/9/10/11/12
			  GPIO_SetBits(GPIOA, GPIO_Pin_15);
				GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
			
        // wait for uart_A1 semaphore, need adding timeout err
			  // uart code need to be fulfilled
				if (xSemaphoreTake( uart_A1_xSemaphore, portMAX_DELAY) == pdTRUE) {
					// hand shake
					// fill buffer as in tab3B1
					// function start: repeated code of hand shake sent tab3B1
					UART_send_buffer[0] = 0xA6;
					UART_send_buffer[1] = 0x0D;
					UART_send_buffer[2] = 0xAA;
					//https://zhidao.baidu.com/question/1638675882443131580.html?qbpn=2_2&tx=&word=%E4%BB%8E%E4%B8%80%E4%B8%AA16%E4%BD%8D%E5%8F%98%E9%87%8F%E4%B8%AD%E5%8F%96%E5%87%BA%E9%AB%988%E4%BD%8D%E5%92%8C%E4%BD%8E8%E4%BD%8D%EF%BC%8C%E6%B1%82C%E8%AF%AD%E8%A8%80%E7%A8%8B%E5%BA%8F%EF%BC%9F&fr=newsearchlist
					code_verify = (UART_recv_buffer[3] + UART_recv_buffer[4]) * UART_recv_buffer[5];
					UART_send_buffer[3] = code_verify & 0xff;
					UART_send_buffer[4] = (code_verify >> 8) & 0xff;
					UART_send_buffer[5] = (code_verify >> 16) & 0xff;
					UART_send_buffer[6] = (code_verify >> 24) & 0xff;
					UART_send_buffer[7] = 0x0B;
					UART_send_buffer[8] = 0x00;
					UART_send_buffer[9] = 0x00;
					UART_send_buffer[10] = 0x00;
					UART_send_buffer[11] = 0x00;
					frame_verify = UART_send_buffer[2] + UART_send_buffer[3] + UART_send_buffer[4] + UART_send_buffer[5] + \
											   UART_send_buffer[6] + UART_send_buffer[7] + UART_send_buffer[8] + UART_send_buffer[9] + \
												 UART_send_buffer[10];
					UART_send_buffer[12] = frame_verify & 0xff;
					UART_send_buffer[13] = 0x86;
					
					// send buffer
					TM_USART_DMA_Send(USART1, (uint8_t *)&UART_send_buffer, 13);   //choose uart line
					//function end
					
					// wait for exti DI13 
					if (xSemaphoreTake( exti_xSemaphore, portMAX_DELAY) == pdTRUE) {
						// real time start
						time_origin = xTaskGetTickCount() * portTICK_RATE_MS;
						
						// creat large/small field task
						xTaskCreate(field_task, "FIELD", configMINIMAL_STACK_SIZE * 4, NULL, FIELD_TASK_PRIO, &field_xHandle);


						// reset duty step to 100
						TIM_SetCompare1(TIM3, 100);
						// first period value
						TIM_SetAutoreload(TIM3, 1333);
						// delay 10 ms
						vTaskDelay(10 * portTICK_RATE_MS);
						// enable tim3
						TIM_Cmd(TIM3, ENABLE);
						
						// seems no use
						if (xSemaphoreTake( pwm_xSemaphore, portMAX_DELAY) == pdTRUE) {
						}
						
						if( process_command_xHandle != NULL ) {
							vTaskDelete( process_command_xHandle );
						}
						
					}
					
				}
				break;	
      case 0x24:		//wireless

				//config DO6/7/9/10/11/12
			  GPIO_SetBits(GPIOA, GPIO_Pin_15);
			  GPIO_ResetBits(GPIOE,GPIO_Pin_1);
				GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
			
        // wait for uart_A1 semaphore, need adding timeout err
			  // uart code need to be fulfilled
				if (xSemaphoreTake( uart_A1_xSemaphore, portMAX_DELAY) == pdTRUE) {
					// hand shake
					// fill buffer as in tab3B1
					// function start: repeated code of hand shake sent tab3B1
					UART_send_buffer[0] = 0xA6;
					UART_send_buffer[1] = 0x0D;
					UART_send_buffer[2] = 0xAA;
					//https://zhidao.baidu.com/question/1638675882443131580.html?qbpn=2_2&tx=&word=%E4%BB%8E%E4%B8%80%E4%B8%AA16%E4%BD%8D%E5%8F%98%E9%87%8F%E4%B8%AD%E5%8F%96%E5%87%BA%E9%AB%988%E4%BD%8D%E5%92%8C%E4%BD%8E8%E4%BD%8D%EF%BC%8C%E6%B1%82C%E8%AF%AD%E8%A8%80%E7%A8%8B%E5%BA%8F%EF%BC%9F&fr=newsearchlist
					code_verify = (UART_recv_buffer[3] + UART_recv_buffer[4]) * UART_recv_buffer[5];
					UART_send_buffer[3] = code_verify & 0xff;
					UART_send_buffer[4] = (code_verify >> 8) & 0xff;
					UART_send_buffer[5] = (code_verify >> 16) & 0xff;
					UART_send_buffer[6] = (code_verify >> 24) & 0xff;
					UART_send_buffer[7] = 0x0B;
					UART_send_buffer[8] = 0x00;
					UART_send_buffer[9] = 0x00;
					UART_send_buffer[10] = 0x00;
					UART_send_buffer[11] = 0x00;
					frame_verify = UART_send_buffer[2] + UART_send_buffer[3] + UART_send_buffer[4] + UART_send_buffer[5] + \
											   UART_send_buffer[6] + UART_send_buffer[7] + UART_send_buffer[8] + UART_send_buffer[9] + \
												 UART_send_buffer[10];
					UART_send_buffer[12] = frame_verify & 0xff;
					UART_send_buffer[13] = 0x86;
					
					// send buffer
					TM_USART_DMA_Send(USART1, (uint8_t *)&UART_send_buffer, 13);   //choose uart line
					//function end
					
					// wait for exti DI13 
					if (xSemaphoreTake( exti_xSemaphore, portMAX_DELAY) == pdTRUE) {
						// real time start
						time_origin = xTaskGetTickCount() * portTICK_RATE_MS;
						
						// creat large/small field task
						xTaskCreate(field_task, "FIELD", configMINIMAL_STACK_SIZE * 4, NULL, FIELD_TASK_PRIO, &field_xHandle);


						// reset duty step to 0
						TIM_SetCompare1(TIM3, 0);
						// first period value
						TIM_SetAutoreload(TIM3, 1330);
						// delay 10 ms
						vTaskDelay(10 * portTICK_RATE_MS);
						// enable tim3
						TIM_Cmd(TIM3, ENABLE);
						
						// seems no use
						if (xSemaphoreTake( pwm_xSemaphore, portMAX_DELAY) == pdTRUE) {
						}
						
						if( process_command_xHandle != NULL ) {
							vTaskDelete( process_command_xHandle );
						}
						
					}
					
				}
				break;				
			default:
				break;			
		}
	}
}

void field_task(void * pvParameters){
	portTickType temp_t;
	int16_t epsilon;
	int16_t beta;
	unsigned int frame_verify;
	do {
		temp_t = xTaskGetTickCount() * portTICK_RATE_MS - time_origin;
		//large field
		if ( temp_t <= 3520 ) {
			UART_field_buffer[0] = 0xA6;
			UART_field_buffer[1] = 0x10;
			UART_field_buffer[2] = 0x81;
			UART_field_buffer[3] = temp_t & 0xff;
			UART_field_buffer[4] = (temp_t >> 8) & 0xff;
			UART_field_buffer[5] = (temp_t >> 16) & 0xff;
			UART_field_buffer[6] = (temp_t >> 24) & 0xff;
			switch (command) {
				case 0x1D:
					epsilon = 0;
					beta = -21537;
					UART_field_buffer[7] = epsilon & 0xff;
					UART_field_buffer[8] = (epsilon >> 8) & 0xff;
					UART_field_buffer[9] = beta & 0xff;
					UART_field_buffer[10] = (beta >> 8) & 0xff;
					break;
				default:
					UART_field_buffer[7] = 0;
					UART_field_buffer[8] = 0;
					UART_field_buffer[9] = 0;
					UART_field_buffer[10] = 0;
					break;
			}
			UART_field_buffer[11] = 0x00;
			UART_field_buffer[12] = 2;
			UART_field_buffer[13] = 0x00;
			frame_verify = UART_field_buffer[2] + UART_field_buffer[3] + UART_field_buffer[4] + UART_field_buffer[5] + \
										 UART_field_buffer[6] + UART_field_buffer[7] + UART_field_buffer[8] + UART_field_buffer[9] + \
										 UART_field_buffer[10] + UART_field_buffer[11] + UART_field_buffer[12] + UART_field_buffer[13];
			UART_field_buffer[14] = frame_verify & 0xff;
			UART_field_buffer[15] = 0x86;
			TM_USART_DMA_Send(USART1, (uint8_t *)&UART_field_buffer, 16);
		}
		//small field
		else {
			UART_field_buffer[0] = 0xA6;
			UART_field_buffer[1] = 0x10;
			UART_field_buffer[2] = 0x81;
			UART_field_buffer[3] = temp_t & 0xff;
			UART_field_buffer[4] = (temp_t >> 8) & 0xff;
			UART_field_buffer[5] = (temp_t >> 16) & 0xff;
			UART_field_buffer[6] = (temp_t >> 24) & 0xff;
			switch (command) {
				case 0x1D:
					epsilon = 0;
					beta = -16383;
					UART_field_buffer[7] = epsilon & 0xff;
					UART_field_buffer[8] = (epsilon >> 8) & 0xff;
					UART_field_buffer[9] = beta & 0xff;
					UART_field_buffer[10] = (beta >> 8) & 0xff;
					break;
				default:
					UART_field_buffer[7] = 0;
					UART_field_buffer[8] = 0;
					UART_field_buffer[9] = 0;
					UART_field_buffer[10] = 0;
					break;
			}
			UART_field_buffer[11] = 0x00;
			UART_field_buffer[12] = 2;
			UART_field_buffer[13] = 0x00;
			frame_verify = UART_field_buffer[2] + UART_field_buffer[3] + UART_field_buffer[4] + UART_field_buffer[5] + \
										 UART_field_buffer[6] + UART_field_buffer[7] + UART_field_buffer[8] + UART_field_buffer[9] + \
										 UART_field_buffer[10] + UART_field_buffer[11] + UART_field_buffer[12] + UART_field_buffer[13];
			UART_field_buffer[14] = frame_verify & 0xff;
			UART_field_buffer[15] = 0x86;
			TM_USART_DMA_Send(USART1, (uint8_t *)&UART_field_buffer, 16);
		}
		vTaskDelay(20 * portTICK_RATE_MS);
	} while(xSemaphoreTake( uart_A1_xSemaphore, 0) != pdTRUE);
}

//void ETH_Printf_task(void * pvParameters)
//{
//  int ch;
//  for ( ;; ) {
//    
//    while (USART_GetFlagStatus(CUSTOM_COM1, USART_FLAG_RXNE) == RESET);
//  	
//    ch = USART_ReceiveData(CUSTOM_COM1);
//	  
//    ETH_printf("%c", ch&0xff);    
//  }
//}


/**
  * @brief  Toggle Led4 task
  * @param  pvParameters not used
  * @retval None
  */
void ToggleLed4(void * pvParameters)
{
  for ( ;; ) {
    /* Toggle LED4 each 250ms */
    STM_EVAL_LEDToggle(LED4);
    vTaskDelay(250);
  }
}

//void LwIP_UDP_task(void * pvParameters)
//{
//  err_t err;
//  const unsigned short src_port = 12345;
//	
//#ifdef USE_DHCP
//	while( xSemaphore_DHCP == NULL )    {
//	}
//		// See if we can obtain the semaphore.  If the semaphore is not available
//		// wait 10 ticks to see if it becomes free. 
//	if( xSemaphoreTake( xSemaphore_DHCP, ( portTickType ) 5 ) == pdTRUE )
//	{
//#endif
//			// We were able to obtain the semaphore and can now access the
//			// shared resource.
//		
//			IP4_ADDR(&dst_addr,192,168,1,97);
//			pcb = udp_new();
//			err = udp_bind(pcb, IP_ADDR_ANY, src_port);
//		
//			// We have finished accessing the shared resource.  Release the 
//			// semaphore.
//#ifdef USE_DHCP
//			xSemaphoreGive( xSemaphore_DHCP );
//#endif
//			vSemaphoreCreateBinary( xSemaphore_UDP );
//			vTaskDelete(NULL);
//#ifdef USE_DHCP
//	}
//	else
//	{
//			vTaskDelete(NULL);
//			// We could not obtain the semaphore and can therefore not access
//			// the shared resource safely.
//	}
//#endif
//}

/**
  * @brief  Initializes the STM324xG-EVAL's LCD and LEDs resources.
  * @param  None
  * @retval None
  */
void LCD_LED_Init(void)
{
#ifdef USE_LCD
  /* Initialize the STM324xG-EVAL's LCD */
  STM32f4_Discovery_LCD_Init();
#endif

  STM_EVAL_LEDInit(LED4); 
#ifdef USE_LCD
  /* Clear the LCD */
  LCD_Clear(Black);

  /* Set the LCD Back Color */
  LCD_SetBackColor(Black);

  /* Set the LCD Text Color */
  LCD_SetTextColor(White);

  /* Display message on the LCD*/
  LCD_DisplayStringLine(Line0, (uint8_t*)MESSAGE1);
  LCD_DisplayStringLine(Line1, (uint8_t*)MESSAGE2);
  LCD_DisplayStringLine(Line2, (uint8_t*)MESSAGE3);
  LCD_DisplayStringLine(Line3, (uint8_t*)MESSAGE4); 
#endif
}

PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  USART_SendData(CUSTOM_COM1, (uint8_t) ch);
	  
